{
  "auto_mapping": {
    "base_model_class": "UNet2DConditionModel",
    "parent_library": "diffusers.models.unets.unet_2d_condition"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "modules_to_save": null,
  "n_frequency": 2592,
  "n_frequency_pattern": {},
  "peft_type": "WAVEFT",
  "proportional_parameters": false,
  "random_loc_seed": 777,
  "revision": null,
  "scaling": 25,
  "target_modules": [
    "to_out.0",
    "to_q",
    "to_v",
    "to_k"
  ],
  "task_type": null,
  "use_idwt": true,
  "wavelet_family": "db1"
}